{
    "id":"nd001",
    "title":"Sharon Stone To Play Lead Villain Opposite Bob Odenkirk In Nobody",
    "full_article":"Last month, we brought you the news that Bob Odenkirk is set to reprise his role as government-assassin-turned-family-man-turned-assassin-again Hutch Mansell in Nobody 2, with Indonesian action-horror filmmaker Timo Tjahjanto (Headshot, The Night Comes For Us) aboard to direct. And now we know who our man Hutch will be putting his, er, Basic Instinct to the test against in the follow-up to Ilya Naishuller's 2021 geriaction romp. Per THR's reporting, Oscar-nominated Hollywood icon Sharon Stone is set to star opposite Odenkirk as the shadowy new big-bad in the sequel.Plot details on Nobody 2 remain firmly under wraps for the time being, but we do know Derek Kolstad (John Wick), Aaron Rabin (Secret Invasion), Umair Aleem, and Odenkirk himself are all on writing duties for this one, with 87North super-duo Kelly McCormick and David Leitch (The Fall Guy) among the movie's producers. As for Stone, Tjahjanto's film is set to be the Casino and The Quick And The Dead star's first real foray into action genre territory, and a real change of direction and pace from her more recent small-screen roles in the likes of psychological thriller Ratched and papal drama The New Pope.As fans of the first Nobody will recall, Naishuller's movie ended with Hutch, fresh from beating off the Russians with brother Harry (RZA) and father David (Christopher Lloyd), getting set for a new start in a new home with his family only for a mysterious phone call to tease that our man Mansell isn't done duffing up wrong'uns just yet. And by the looks of things, the latest of said wrong'uns will be hailing from a little closer to home. We'll see what's next for Odenkirk's geriaction hero when Nobody 2 hits cinemas on 15 August, 2025. Nobody 2: Hutch Gets Stoned, anybody? Anybody?",
    "image":"https://images.bauerhosting.com/empire/2024/07/Nobody-2-2.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}