{
    "id":"nd002",
    "title": "Twisters Whips Up $123 Million Storm At The Box Office As Disaster Movie Sequel Hits US Cinemas",
    "full_article":"Lee Isaac Chung's Twisters is feeling it and chasing it at the box office! That's right folks, the Minari filmmaker will be feeling wonderful (wonderful) after his disaster movie sequel stormed to an almighty $123 million at the global box office this past weekend. The Glen Powell, Daisy Edgar-Jones, and Anthony Ramos starrer made it rain to the tune of $80.5 million on its domestic opening Stateside (a disaster flick record that eclipses The Day After Tomorrow's $68.4 million open back in 2004), whilst internationally the follow-up to Jan De Bont's OG Twister has now brewed up a cool further $42.5 million.The critical and commercial success of Twisters continues a summer box office season that's overcome a nervy start with the underwhelming turnouts for Furiosa: A Mad Max Saga and The Fall Guy and gone from strength to strength of late. In the last couple of months, we've seen Inside Out 2 spark box office joy for Pixar, breaking the billion dollar barrier globally and now comfortably cruising towards the coveted slot of highest grossing animated movie of all-time as its current cume sits at $1.443 billion. Elsewhere, A Quiet Place: Day One has made a racket at multiplexes worldwide with a franchise best opening weekend, Despicable Me 4's gotten into its _Gru_ve with $574.4 million taken before the summer holidays had even begun, and movies like Bad Boys: Ride Or Die and Nic Cage x Maika Monroe chiller Longlegs have all seen cinemagoers filling foyers once again.After the aforementioned slow start to the summer, and the sobering recent news of Kevin Costner's Horizon: An American Saga — Chapter 2 pulling its August release plans following Chapter 1's theatrical underperformance, Twisters has perfectly timed its Category 5 landing at the box office. And with Deadpool & Wolverine finally suiting up to hit cinemas later this week, all signs point towards a scorching month ahead for our beloved bricks-and-mortar cinemas. Now don't mind us, we're just off to catch Twisters again in 4DX so we can really feel it one more time. Let's ride!",
    "image":"https://images.bauerhosting.com/empire/2024/07/Twisters.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}