{
    "id":"nd005",
    "title": "Andrew Scott Set To Lead World War II D-Day Movie Pressure",
    "full_article":"Is there anything Andrew Scott can't do? The man's on the hottest streak of his career right now on all fronts, having broken our hearts in All Of Us Strangers on the big screen, beguiled us with his insouciant psychopathic cool in Steven Zaillian's eminently bingeable Ripley, and blown minds with his masterful one-man take on Vanya on the West End last year. Now, per Deadline's reporting, the Band Of Brothers and 1917 star is set to make a return to the war genre in Hotel Mumbai director Anthony Maras' Pressure, a true story ticking-clock thriller set amidst the D-Day landings in WWII.Written by Maras alongside David Haig, on whose critically acclaimed play this movie is based, Pressure will see Andrew Scott take on the role of Group Captain James Stagg. A Met Office meteorologist who worked with the RAF during the Second World War, Stagg was the man responsible for persuading General Dwight D. Eisenhower to change the date of the Normandy Landings right at the last minute, saving thousands of lives and changing the course of the war in the process.Here's the official synopsis: “In the seventy two hours leading up to D-Day, all the pieces are in place except for one key element—the British weather. Britain's chief meteorological officer James Stagg (Scott) is called upon to deliver the most consequential forecast in history, locking him into a tense standoff with the entire Allied leadership. The wrong conditions could devastate the largest ever seaborne invasion, while any delay risks German intelligence catching on. With only his trusted aide Captain Kay Summersby to confide in, and haunted by a catastrophic D-Day rehearsal, the final decision rests with Supreme Allied Commander Dwight D. Eisenhower. With only hours to go, the fate of the war and the lives of millions hang in the balance.”Due to shoot in the UK this September, Maras' film has no release window or further casting announcements beyond Scott's involvement yet. Even so, James Stagg's is one of those remarkable 'one moment that changes everything' true stories — filled with incredible tension and feats of unfathomable derring-do — that feels ripe to make the leap from the stage to the screen. And with the prospect of Andrew Scott in front of the camera and Maras and Haig behind it for this one, we say: bring on the Pressure.",
    "image":"https://images.bauerhosting.com/empire/2024/07/andrew-scott.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}