{
    "id":"nd006",
    "title": "Alien: Romulus Trailer: Facehuggers And Chestbursters Go Berserk In Fede Alvarez's Sci-Fi Horror",
    "full_article":"When Empire spoke to Fede Alvarez, director of Alien: Romulus, last month, the man behind 2013's gnarly Evil Dead reboot and subversive 2016 home invasion chiller Don't Breathe revealed the Alien-meets-Aliens aspirations of his hotly anticipated upcoming sci-fi horror movie. And if the final facehugger-filled, chestburster-packed, incredibly creepy trailer for Alvarez's new entry in the Alien saga is anything to go by, then it looks like he's absolutely nailed the assignment here. Check it out:Give us a minute — that was intense! The trailer kicks off slowly, forebodingly, with a reminder of Alien: Romulus' set-up as we meet Cailee Spaeny's Rain Carradine, leader of a scavenger crew — including David Jonsson, Archie Renaux, Isabela Merced, Spike Fearn, and Aileen Wu — whose time-sensitive heist plans are scuppered when they come face-to-face(hugger) with their target ship Romulus' xonomorph-y denizens. 'This place gives me the creeps,' states one of the crew over shadowy shots of the Nostromo-like Romulus' eerily empty corridors. We'll say! Within moments, we see Alvarez flip the switch to full nightmare fuel mode as Rain and her crew find themselves facing flying facehuggers, a splattersome chestburster, and a full-sized Xenomorph drone, the would-be thieves turned into straight-up soldiers as they take up arms to take the fight to their extraterrestrial foes. It's all properly scary, properly pulsating stuff — so very Alien-meets-Aliens indeed!With news coming earlier today that Noah Hawley's Alien: Earth series has just wrapped filming, and this last trailer for Alien: Romulus boding well for Alvarez and writing partner Rodo Sayagues making good on their promise to take Alien back to its roots, it's an exciting time to be a fan of the iconic sci-fi horror franchise. And whilst in space nobody can hear you scream, catch us screaming in the cinema when Alien: Romulus releases on 16 August.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Alien-Romulus-3.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}