{
    "id":"nd007",
    "title": "Conclave Trailer: Ralph Fiennes Uncovers A Papal Conspiracy In Edward Berger Thriller",
    "full_article":"Forget Pulp Fiction — how about some Pope fiction? Yes folks, following the Oscar- and BAFTA-award winning success of Edward Berger's anti-war epic All Quiet On The Western Front, the feted filmmaker is turning his attention from trench warfare to Catholic conspiracy with Conclave, an all-star adaptation of Robert Harris' international bestseller papal thriller. Ralph Fiennes leads the line-up for this one as Cardinal Lawrence, the man responsible for selecting a new Pope after the last one's death. It's a hard task made harder by some secretive shenanigans in the Vatican, as is evidenced in the gripping first trailer for the film.Gorgeous sets courtesy of Rome's legendary Cinecittà studios. Lavish production design. Acting heavyweights everywhere you turn. Volker Bertelmann back on scoring duties. Pardon the blasphemy but Jesus Christ this looks impressive! 'No sane man would want the papacy. The men who are dangerous are the ones who do want it.' So says Stanley Tucci's Cardinal Bellini in this tension-filled first look at Berger's latest, written by Tinker, Tailor, Soldier, Spy scribe Peter Straughan. As we soon learn, Tucci's Cardinal is one such man who does want it, as is John Lithgow's Cardinal Tremblay, and the crux of the drama seems centred around Fiennes' fraught Cardinal Lawrence, the man tasked with overseeing the new Pope's selection amidst all the political manoeuvring and clandestine clutches for power. Isabella Rossellini's Sister Agnes meanwhile, one of the Vatican's many 'invisible' women, looks to be key to unearthing Conclave's secrets. All very intriguing if you ask us...Here's the official synopsis: 'Conclave follows one of the world's most secretive and ancient events - selecting a new Pope. Cardinal Lawrence (Ralph Fiennes) is tasked with running this covert process after the unexpected death of the beloved Pope. Once the Catholic Church's most powerful leaders have 'gathered from around the world and are locked together in the Vatican halls, Lawrence finds himself at the centre of a conspiracy and discovers a secret that could shake the very foundation of The Church.'Among the supporting cast for this one are Sergio Castellitto as Cardinal Tedesco, Lucian Msamati as Cardinal Adeyemi, Brian F. O'Byrne as O'Malley, and Carlos Diehz. On present evidence, it looks like Berger's All Quiet On The Western Front follow-up is set to be another psychologically complex inquiry into morality, humanity, and the structures of power we find ourselves beholden to. Or, in other words, an absolute cerebral banger! We'll find out whether Fiennes can work out his papal problems when Conclave arrives in cinemas this November.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Conclave.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}