{
    "id":"nd009",
    "title": "Glen Powell Could Be Set To Star In Backdraft Remake",
    "full_article":"Have you got any salt handy? You may want to take a pinch of it for this one. Following recent star turns in Top Gun: Maverick, Anyone But You, Richard Linklater's Hit Man, and buzzy summer disaster movie blockbuster Twisters, it would be fair to say that Glen Powell is very hot right now. But he could be about to get hotter — quite literally. In a recent interview with CNBC posted to the broadcaster's YouTube channel, Imagine Entertainment co-founder Brian Grazer said not once, but twice, that a remake of Ron Howard's 1991 firefighting classic Backdraft is in the works, with none other than Powell set to star. Check out the interview clip below (feel free to scrub through to 1:20 and 2:20);Now, as we say, some salt-pinching is required at this stage because neither Powell nor original Backdraft director Howard are on the record as saying this film is happening just yet. However, there is a somewhat compelling case to be made for it. Aside from the fact that Powell is proving quite the king when it comes to bringing his particular brand of throwback star power to legacy titles (see the aforementioned Top Gun: Maverick and Twisters), Howard has expressed an interest in revisiting the Kurt Russell and William Baldwin starrer not so long ago. 'Backdraft would be really good [to adapt],' said Howard an interview with Entertainment Weekly last year, expressing an interest in a potential TV reworking of his film about two feuding siblings fighting fires in Chicago. 'You could get the scope and the intensity that we had to do all in-camera — now we could do it efficiently and safely.'In that self-same interview with EW, Howard did also mention that Grazer had talked about a remake 'from time to time', so never say never. For the time being at least though, one Powell reboot of a late 20th century classic that definitely is on its way is Edgar Wright's in-production retooling of The Running Man, which Powell revealed is shooting this year whilst talking to IndieWire earlier this week. As for this Backdraft remake business, we'll tell you more when there's more to tell. But, as the saying goes, there's no smoke without fire — so watch this space!",
    "image":"https://images.bauerhosting.com/empire/2024/07/Glen-Powell-Backdraft.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}