{
    "id":"nd010",
    "title": "Julia Garner Stars In First Look Images Of Rosemary's Baby Prequel Thriller Movie Apartment 7A",
    "full_article":"Back to the Bramford Building we go! Following in the footsteps of recent legacy horror revisits such as The First Omen and The Exorcist: Believer, Relic filmmaker Natalie Erika James' Paramount+ prequel picture Apartment 7A is set to tell the story that leads into Roman Polanski's genre classic Rosemary's Baby. The movie, which stars Golden Globe winning Ozark and The Royal Hotel Julia Gardner drops on the streamer on 27 September in the States ahead of a later international release. Check out some first look images from the film below;On point 60s period detailing. Jaundiced, lugubrious lighting. Fraught faces. Sinister Dianne Wiest. They say a picture paints a thousand words, but these seven bring just one to mind — ominous. Set in 1965 New York City, James' film — co-written by the director alongside Christian White and Skylar James — explores the goings-on in the titular abode and its associated accursed building before Rosemary and her devil spawn rocked up.Here's the official synopsis: 'An ambitious young dancer Terry Gionoffrio (Garner) dreams of fame and fortune in New York City, but after suffering a devastating injury, an older, wealthy couple (Dianne Wiest and Kevin McNally) welcomes her into their home in the luxury apartment building the Bramford. When fellow resident and influential Broadway producer (Jim Sturgess) offers her another chance at fame, it seems that all her dreams are finally coming true. However, after an evening she can't fully remember, disturbing circumstances soon have her second-guessing the sacrifices she's willing to make for her career as she realizes that something evil is living not only in Apartment 7A, but in the Bramford itself.'Also shacking up in the Bramford for all sorts of Satanic shenanigans in Apartment 7A are Marli Siu (Everything I Know About Love), Andrew Buchan (All the Money in the World), Rosy McEwen (Blue Jean) and Kobna Holdbrook-Smith (Wonka). Whether this one winds up being devilishly good or an altogether more hellish experience, only time will tell. But with an excellent ensemble assembled, James — whose last film proved she knows her way around psychologically complex, allegorical horror — at the helm, and one of the greatest horror movies (and books) of all time for source material, we can't wait to head inside Apartment 7A later this year. Just don't let us forget to bring a few crucifixes and some holy water, now.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Apartment-7A-6.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}