{
    "id":"nd011",
    "title": "The Russo Brothers In Early Talks To Direct Avengers 5 And Avengers: Secret Wars For Marvel",
    "full_article":"As a wise purple-faced Titan once kinda said (in a trailer at least), 'Fun isn't something one considers when balancing the Marvel Cinematic Universe, but this does put a smile on our faces.' In news we can guarantee absolutely none of us saw coming, it looks like the MCU's prodigal directorial sons Anthony and Joe Russo are getting ready for a hell of a comeback. According to THR, the duo behind Captain America: The Winter Soldier, Captain America: Civil War, and the one-two Infinity Saga ending punch that was Avengers: Infinity War and Avengers: Endgame are in early talks to helm upcoming superhero team-ups Avengers 5 and Avengers: Secret Wars.In recent weeks, we've heard reports that Deadpool & Wolverine director Shawn Levy may have been the man to replace Destin Daniel Cretton in the hotseat for Avengers 5 (formerly sub-titled The Kang Dynasty). But now, after months of searching, it looks like Kevin Feige is ready to call in some friends from work to help carry home the MCU's Multiverse Saga. We already know that Loki and Doctor Strange In The Multiverse Of Madness scribe Michael Waldron is on script duty for the fifth Avengers team-up at least, and The Russo Brothers — whose post-Marvel endeavours have included Cherry, The Gray Man, and Prime Video espionage series Citadel — have a proven track record for delivering the goods with saga-ending blockbusters. Not only did Avengers: Endgame scoop an eye-watering $2.8 billion at the box-office, making it the highest grossing movie ever made (at least until Avatar: The Way Of Water came along), but Tony Stark and co's last stand remains among the most acclaimed superhero movies of the 21st century.The prospect of a Russo Brothers MCU homecoming is the latest in a slew of exciting goings-on at Marvel Studios. With the aforementioned Deadpool & Wolverine mere days away, _X-Men '97_nabbing an Emmy nomination earlier today, Fantastic Four preparing to take fans of Marvel's First Family back to the 60s, and exciting new trailers for Agatha All Along and Captain America: Brave New World marking the start of an exciting upcoming slate of MCU offerings on the big and small screen, it looks like a bright new era awaits. Avengers 5 is currently set to hit cinemas on 1 May, 2026, whilst Avengers: Secret Wars is looking at a 7 May, 2027 arrival in theatres. Marvel-ous stuff!",
    "image":"https://images.bauerhosting.com/empire/2024/07/The-Russo-Brothers.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}