{
    "id":"nd012",
    "title": "M3GAN 2.0 Begins Shooting As Release Date Shifts To Summer 2025 And New Cast Additions Announced",
    "full_article":"New M3GAN 2.0 update incoming! Following the recent news that the MCU (that's the M3GAN Cinematic Universe, of course) is set to expand with 90s style AI erotic thriller SOULM8TE, the killer android franchise's own Sacred Timeline is picking up a head of steam as production begins on M3GAN 2.0. The shooting news came via a creepy video of M3GAN's animatronic skull shared by Jason Blum on X, the platform formerly known as Twitter. What's more, per Deadline's reporting, the horror movie — previously eyeing a January 2025 release — is now slated to hit cinemas on 27 June, 2025. And that's not all that's new with the synthetic slasher's sequel, either.As confirmed by Deadline, Timm Sharp (Percy Jackson And The Olympians), Aristotle Athari (Silicon Valley), and Jemaine Clement (Flight Of The Conchords, Moana) have all boarded the cast for more stab-happy AI antics. They join previously confirmed cast returnees Allison Williams, Violet McGraw, and Jenna Davis, series newcomer Ivanna Sakhno (Ahsoka), and Brian Jordan Alvarez and Jen Van Epps, whose returns as techies Cole and Tess was revealed alongside the new casting announcements. The new cohort's roles, much like the movie's plot, remain firmly under wraps for now, but we do at least know that Gerard Johnstone and Akela Cooper are back to write and direct respectively on M3GAN 2.0.As fans of the first film will recall, M3GAN's wild climax saw roboticist Gemma (Williams) and her niece Cady (McGraw) tear apart the titular emotional-support-robot-gone-evil and stab her right in the processor. However, a final frame sting suggested M3GAN's consciousness had somehow been transferred to Gemma's home security system, paving the way for more dancing doll of death",
    "image":"https://images.bauerhosting.com/empire/2024/07/cNHXdmr4amP6EPCMa0dqD8rwzDV.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}