{
    "id":"nd013",
    "title": "The Killer Trailer: Nathalie Emmanuel Is A Deadly Assassin In John Woo's Classic Action Movie Remake",
    "full_article":"A new action movie starring Game Of Thrones' Nathalie Emmanuel and Lupin's Omar Sy would always be worthy a hearty 'Woo!' in our book. But a new action movie starring that duo that's also a remake of a Chow Yun-Fat genre classic? Now that's worthy of a John Woo! And that's exactly what we get in the high-octane first trailer for The Killer, the legendary action director's upcoming (and long-gestating) remake of his own 1989 bullet ballet banger. Check it out below;Flying doves? Check. Spectacular gun-fu? Check. Operatic slow-mo explosions? Check. Yeah, we're thinking John Woo's back! After releasing his first Hollywood movie in twenty years with last year's Silent Night, it looks like Woo's really going for broke with his second, which brings a story from his Hong Kong genre heyday into the 21st century with a bang (or indeed several, as the case most assuredly will be). In this oozingly stylish new trailer, we get to see Nathalie Emmanuel's trench-coated and wide-brimmed hat wearing Zee (a gender-swapped take on Yun-Fat's role in the original film) show why her codename is 'Queen Of The Dead' as she makes it rain bullets in a Parisian nightclub, piss off Parisian crime boss Eric Cantona (yes, *that* Eric Cantona!), and get caught up in a deadly game of cat-and-mouse with Omar Sy's doggedly determined detective. There's also a Woo-nderfully kick-ass moment where Zee coolly says 'Never send boys to do a woman's job' over shots of her vaulting gravestones and leaping, guns akimbo, in a cathedral — well worth its own mention!For those who haven't seen the original movie (rectify that ASAP!), here's a synopsis: 'Zee is a mysterious and infamous assassin known, and feared, in the Parisian underworld as the Queen of the Dead. But when, during an assignment from her shadowy mentor and handler (Sam Worthington), Zee refuses to kill a blinded young woman (Diana Silvers) in a Paris nightclub, the decision will disintegrate Zee's alliances, attract the attention of a savvy police investigator (Sy), and plunge her into a sinister criminal conspiracy that will set her on a collision course with her own past.'We'll find out whether this The Killer is as much of a killer as the original The Killer (and also David Fincher's The Killer) when John Woo's all-new The Killer arrives on Peacock on 23 August. Release the doves",
    "image":"https://images.bauerhosting.com/empire/2024/07/The-Killer-2024.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}