{
    "id":"nd014",
    "title": "A Different Man Trailer: Sebastian Stan Makes A Radical Transformation In A24 Psychological Thriller",
    "full_article":"Sebastian Stan has played Bucky Barnes in the MCU, Tommy Lee in the r-rated series Pam & Tommy, and is soon to star as former American President Donald J. Trump in Ali Abbasi's The Apprentice. And Stan is set to play a different man again in writer-director Aaron Schimberg's cannily titled upcoming A24 psychological thriller A Different Man. Here, Stan stars as Edward, a neurofibromatosis afflicted aspiring actor who learns the grass may not always be greener on the other side when he undergoes radical surgery that changes his face and his life in unimaginable ways. Check out the intriguing first trailer for the new movie below;'All happiness in life comes from accepting what is' — or at least so says a kindly neighbour at the start of this new trailer as we meet malcontent thespian Edward (an utterly unrecognisable Stan in full facial prosthetics). Those pearls of wisdom loom over the scenes that follow as we see Edward undergo 'life-changing' surgery that gives him Sebastian Stan's more recognisable, ruggedly handsome good looks, only to be hit for six when fellow neurofibromatosis sufferer Oswald (Adam Pearson) rocks up on the scene. Confident, charming, and charismatic, Oswald — also an actor — essentially has the life Edward has always dreamed of and has just given up which, by the looks of it, sends our man Stan spiralling down a path of vengeful rage and jealousy as he seeks to reclaim what he's lost. One shot of Edward screaming 'Take it off!' as he tries to pull off Oswald's face is particularly confronting and bold, especially given Pearson's real-life status living with neurofibromatosis.Caught in the middle of the meta-drama as Oswald prepares to star in a play based on Edward's life is The Worst Person In The World star Renate Reinsve. We'll get to experience Stan's remarkable transformation — and Edward's — for ourselves when A Different Man hits cinemas on 20 September.",
    "image":"https://images.bauerhosting.com/empire/2024/07/A-Different-Man.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}