{
    "id":"nd015",
    "title": "Timothée Chalamet To Lead Josh Safdie's A24 Ping Pong Movie Marty Supreme",
    "full_article":"May thy ping pong paddle chip and shatter! Whilst his brother and fellow filmmaker Benny is busy shooting MMA movie The Smashing Machine with Dwayne Johnson and Emily Blunt, Josh Safdie is also hard at work and recruiting for his own solo directorial debut. As reported by Variety, Dune star Timothée Chalamet is set to star in and produce Safdie's new A24 joint Marty Supreme, written by the Uncut Gems co-director alongside regular writing partner Ronald Bronstein. Check out A24's ping pong ball featuring movie announcement post on X, the platform formerly known as Twitter, below;Details about the film are scarce thus far, but Variety reports that whilst sources close to Marty Supreme indicate the movie presents a fictionalised story, it will be one at least inspired by legendary American ping pong star Marty Reisman. Affectionately known as 'the wizard of table tennis', Reisman — who won 22 major ping pong titles in a six-decade-spanning career — enjoyed an astonishing career. Having started out hustling for bets and prizes in his native New York as a kid, Reisman would go on to play as an opening act for the Harlem Globetrotters, become the oldest national championship winner in the sport's history at age 67 in 1997, and feature at the heart of many tales of sporting derring-do (comedian Jonathan Katz once recalled a kid Reisman besting him with the flat end of a chess piece) before his passing, aged 82, in 2012.We'll share more details on Marty Supreme just as soon as they're revealed, but already the prospect of a Chalamet x Safdie x A24 collaboration to tell any kind of story about the eccentric table tennis maverick is one that has us very excited. And in the meantime, if you want to learn more about Marty Reisman, might we recommend Leo Leigh's fascinating documentary Fact Or Fiction, which you can watch for free on the filmmaker's website.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Timothee-Chalamet-Josh-Safdie.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}