{
    "id":"nd016",
    "title": "Anora Trailer: Mikey Madison Falls For A Russian Oligarch's Son In Wild Sean Baker Romance Movie",
    "full_article":"Over the last decade, Sean Baker has proven himself to be one of the great American independent filmmakers of the 21st century. From iPhone-shot LGBT drama Tangerine, to spellbinding motel-set coming-of-age movie The Florida Project, to Simon Rex starrer Red Rocket, the writer-director has made a fascinating filmography out of studying characters living amidst the rubble of the American Dream. His latest, Palme d'Or winner Anora, looks set to continue that trend as Baker tells a wild love story revolving around American stripper Anora (Mikey Madison) and Russian oligarch son Vanya (Mark Eidelstein). Check out the first trailer for the film below;Hoo boy — the Pretty Woman meets Uncut Gems vibes are strong with this one! Set to Blondie banger 'Dreaming', this propulsive first look at Anora is a real tale of two halves. The first half plays out like a 21st century spin on the Richard Gere and Julia Roberts classic as Scream star Madison's Anora meets Eidelstein's minted Vanya in a nightclub, only for the pair's mutually beneficial sex-for-cash arrangement to be taken to the next level when they elope and get hitched in a whirlwind Vegas wedding. The mood soon changes in the trailer's back half as Vanya's family back home in Russia get word of the wedding and Anora's sex worker status, spurring an intercontinental tug-of-love as the couple face the music together.Also along for the wild ride with Vanya and Anora here are Yuri Borisov, Karren Karagulian, Vache Tovmasyan, Lindsey Normington, Ivy Wolk, Luna Sofía Miranda, Alena Gurevich, Aleksei Serebryakov and Darya Ekamasova. With Anora already generating a real buzz and garnering rave reviews across the board, and Baker once more committing himself to centring the lives of sex workers in his work at a moment when that industry and continues to be ostracised and vilified in the media at large, all signs point towards this being another essential watch when it hits cinemas in the UK on 1 November.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Anora-Trailer.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}