{
    "id":"nd017",
    "title": "Lee Trailer: Kate Winslet Is A War Photographer On The Frontline In WWII Biopic Movie",
    "full_article":"2024 has been some year for the importance of photojournalists being writ large both on screen and in the news. Earlier this year, Alex Garland's Civil War envisioned its cautionary tale of an imagined new American Civil War literally through the lens of war photographers Lee Smith (Kirsten Dunst) and Jessie Cullen (Cailee Spaeny). Just this past weekend, a turning point in the States' Presidential race was captured in an extraordinary image of a bloody-eared Donald Trump. Now, in Cinematographer Ellen Kuras' feature directorial debut Lee, Oscar winner Kate Winslet is set to tell the story of a decade in the life of iconic American war photographer and WWII correspondent Lee Miller. Check out the trailer for the Sky Original movie below.Produced by Winslet and written by Liz Hannah, Marion Hume, and John Collee, Lee is something of a passion project for the Titanic actor, who personally paid the crew's salary for two weeks during production. And that commitment to telling Miller's story is apparent on screen too, with this striking first trailer showing Winslet's Miller in action on the frontline in Nazi Germany, facing rampant sexism on the home front, and wrestling with her own secrets and desires whilst trying to capture in her work the horrors of war. We also get glimpses here of the remarkable ensemble Kuras has assembled for Lee, including Andy Samberg as Life Magazine photographer David E. Scherman, Alexander Skarsgård as Miller's lover Roland Penrose, Marion Cotillard as French Vogue fashion director Solange D'Ayen, and Andrea Riseborough as British Vogue Editor Audrey Withers. Josh O'Connor also pops up as a young journalist named Tony.Here's the official logline: 'What she captured on film in Dachau and throughout Europe was shocking and horrific. Her photographs of the war, its victims and its consequences remain among the most significant and historically important of the Second World War. She changed war photography forever, but Lee Miller paid an enormous personal price for what she witnessed and the stories she fought to tell.'Lee comes to cinemas in the UK and Ireland on 13 September, 2024.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Lee-Trailer.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}