{
    "id":"nd018",
    "title": "Emerald Fennell Sets New Wuthering Heights Adaptation As Next Movie",
    "full_article":"Provoc-auteur Emerald Fennell's most recent film, last year's opinion splitting, discourse stoking satire Saltburn, took viewers into a Gothically infused world of passion, revenge, death, and obsession. And if the Promising Young Woman filmmaker's most recent post on X, the platform formerly known as Twitter, is anything to go by, then it looks like her next film will follow in a similar vein. Taking to the social media site on Friday evening, Fennell shared a striking Katie Buckley drawn illustration adorned with the words Wuthering Heights — A Film By Emerald Fennell, along with a quote from Emily Brontë's 1847 Gothic romance. Check it out below;'Be with me always — Take any form — Drive me mad' reads the illustration, which features a creepy potion-brewing skeleton with distended limbs. These are the recognisable words of Brontë's Byronic hero Heathcliff in the novel, which centres around the tumultuous history of the titular farmhouse and the destructive romance embarked upon by Heathcliff (another Liverpudlian protagonist for Fennell after Saltburn's Prescot-born Oliver Quick) and his adoptive sister Catherine Earnshaw. Described on release as 'a compound of vulgar depravity and unnatural horrors', the subversive, transgressive nature of Brontë's first and only novel seems a natural fit within Fennell's own milieu of taboo-busting, provocative cinematic stories. And in terms of setting, 'haunted rural homestead in the English countryside' is one Fennell and fans of her work will feel right at home in after Saltburn.As of yet, there's no word on who'll be in this latest adaptation of Wuthering Heights, where distribution is coming from, or when we can expect to see Fennell's latest sure-to-be discourse driving film. But if there's anyone with the skill and artistic sensibility to capture the dark heart and doomed romance of Brontë's book then it's surely Fennell, whose first two films have both mesmerised with their capacity to shock, excite, and challenge cinemagoers. And if you need a director who's a dab-hand at manoeuvring some uncomfortable graveside shenanigans, then Fennell's certainly your gal (if you know you know). We'll catch you out on the wiley, windy moors just as soon as we hear more about this one!",
    "image":"https://images.bauerhosting.com/empire/2024/07/Emerald-Fennell.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}