{
    "id":"nd019",
    "title": "Regina King To Star Alongside Austin Butler And Zoë Kravitz In Darren Aronofsky's Caught Stealing",
    "full_article":"Darren Aronofsky's next movie, Caught Stealing, has nabbed itself another A-List powerhouse actor to lead its increasingly starry line-up. Following the news earlier this week that Zoë Kravitz is in talks to join Austin Butler in The Whale filmmaker's latest, today Deadline have reported that Academy Award winner Regina King has signed on to help bring Aronofsky's buzzy crime thriller to life.Based on Charlie Huston's books of the same name, the mother! director's film — adapted for screen by Huston himself — will see Butler star as Hank Thompson, a burnt out former baseball player. Things get hairy for Hank when he finds himself unwittingly embroiled in the Big Apple's criminal underground and left fighting for survival on the downtown streets of 90s NYC. Further details on the direction Aronofsky's movie will take remain under wraps for now, as does info on how King and Kravitz will factor into things, but with Huston's book — the first of a trilogy — heavily homaging pulpy works of noir fiction, the project seems set to be an exciting change of pace for all involved parties.Whilst we have no word as of yet on a release date or when production is likely to begin, you don't have to wait to see Caught Stealing's stars in action. It's already been a busy 2024 for Butler, who's enjoyed starring roles in Apple TV prestige war drama Masters Of The Air, Denis Villeneuve's Dune Part Two, and Jeff Nichols' The Bikeriders. As for Kravitz and King, the former is preparing to release her Channing Tatum led directorial debut Blink Twice next month, whilst the latter stars — and shines — as political trailblazer Shirley Chisholm in recent Netflix offering Shirley. As for the trio's collaboration with Aronofsky, it may be a while off yet, but it's stolen our curiosity and our attention already.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Regina-King.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}