{
    "id":"nd020",
    "title": "The Empire Film Podcast #625 ft. Maika Monroe, Griffin Dunne",
    "full_article":"On this week's Empire Podcast we have another brace of cracking guests. First up, It Follows star Maika Monroe returns to the show to talk to Chris Hewitt about her terrifying new horror film, Longlegs [25:43 — 39:01 approx], inadvertently inspiring Chris to launch the Empire Podcast Hall Of Fame for repeat guests in the process. Elsewhere, making his long, long overdue debut on the pod is the great Griffin Dunne, star of An American Werewolf In London and After Hours, who sits down with Chris to talk about his memoir, The Friday Afternoon Club: A Family Memoir [59:29 - 1:19:24 approx]. It's a conversation that runs the emotional gauntlet from the funny to the tragic, and we hope he comes back many times — a Hall Of Fame spot surely awaits.Either side of our star interviews, Chris is joined in the podbooth this week by Helen O'Hara and Alex Godfrey to tackle this week's Gladiator II inspired listener question: Do we think that trailers these days give too much away? (*Spoiler Alert* — they do!) Elsewhere, the team also discuss the rest of the week's movie news, taking the time to pay a heartfelt tribute to legendary Avatar and Titanic producer Jon Landau, who died this past week aged just 63. Also, it is worth noting that this week's episode was recorded before we learned of the sad death of Shelley Duvall, which will surely be discussed on the pod next week.And as if the above wasn't enough to get through already, we also find time to review Miniony fourquel Despicable Me 4, Oz Perkins' heart-rate raising horror-thriller Longlegs, ambient POV slasher In A Violent Nature, experimental Brian Eno doc Eno, Greg Berlanti's 60s set space comedy Fly Me To The Moon, and wackadoodle low-budget comedy phenomenon Hundreds Of Beavers. Which, despite what you may think, is not the name of the porno that James Dyer was definitely not making in lieu of this week's show. As ever, please do enjoy.You can listen to this week's episode (and over 600 more) on the pod app of your choice — or via the PlanetRadio player above.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Maika-Monroe-Griffin-Dunne.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}