{
    "id":"nd021",
    "title": "Captain America: Brave New World Trailer: Anthony Mackie And Harrison Ford Face Off In MCU Thriller",
    "full_article":"It's been a while since we've seen Steve Rogers' star-spangled vibranium shield in action in the Marvel Cinematic Universe - five years have passed since he handed it over to Sam Wilson (Anthony Mackie) at the close of Avengers: Endgame, and it was back in 2021 that we saw Sam grapple with what the shield represents in The Falcon And The Winter Soldier. But now, the new Cap is back - and with a new Thaddeus 'Thunderbolt' Ross, too, in the form of Harrison Ford - in superhero fourquel Captain America: Brave New World, which sees Sam step into his new role proper. We definitely appear to be back in the territory of previous Captain America sequels The Winter Soldier and Civil War, in which the Russo brothers defined a more grounded, political thriller-style approach to the stories of Steve Rogers. Here, we start with Sam coming up against Ford's Ross, with the latter keen to implement Captain America as a military figure and the former unsure of quite how that will work. Whilst there will clearly be tension between the two, Sam leaps into protective action when first-generation supersoldier Isaiah Bradley (Carl Lumbly), who we met in the Falcon Disney+ show, launches an attack.Cue many explosions, a military funeral, plenty of action (including Sam flying about in his Falcon suit technology) - and the introduction of Giancarlo Esposito as the apparent antagonist of the movie. Who Esposito is playing is still unclear, though there is online speculation that he might have been cast as George Washington 'G.W.' Bridge, a morally ambiguous character from the comics who was part of a mercenary group called the 'Wild Pack', later known as the 'Six Pack', led by Cable - who we have seen played by Josh Brolin in Deadpool 2. And there is a newly MCU-integrated Deadpool movie out in just a couple of weeks. The plot thickens…Elsewhere in the cast is Danny Ramirez as Joaquin Torres (also introduced in The Falcon And The Winter Soldier), plus new addition Shira Haas as Sabra, who appears to be a government agent. And glimpsed right at the end is, we assume, Red Hulk, the radiation-enhanced alter-ego of Thaddeus Ross himself. Will we see Harrison Ford hulking out? We'll find out when Captain America: Brave New World hits cinemas on 14 February 2025.",
    "image":"https://images.bauerhosting.com/empire/2024/07/cap-1.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}