{
    "id":"nd022",
    "title": "The Substance Trailer: Demi Moore Turns Into Margaret Qualley In Coralie Fargeat's Body Horror Movie",
    "full_article":"With subversive 2018 rape-revenge thriller Revenge, French filmmaker Coralie Fargeat marked herself out as a director of singular style and substance. Now, the director — who's most recently helmed the noodle-twisting ninth episode of Netflix's The Sandman — is bringing that style to buzzy, Cannes award-winning satirical body horror The Substance, which sees Demi Moore play an over the hill TV personality who takes an experimental serum to become Margaret Qualley. Following our cryptic first look at the film back in May, check out MUBI's newly released teaser for the film below;A minute long, no spoilers, bags of intrigue, and vibe-heavy — now that's how you make a trailer, people! 'Have you ever dreamt of a better version of yourself? Younger, more beautiful, more perfect?' purrs Dennis Quaid at the start of the teaser over shots of a mascara-streaked Demi Moore staring in the mirror. Cue enigmatic glimpses of Margaret Qualley in 80s workout video garb, a toxic-looking serum named 'Activator', and startling images of crashing cars, smashing tables, a blood-spattered Qualley, and Quaid lecherously declaring 'Pretty girls should always smile!' It's intense, cryptic, incredibly provocative stuff set to some Challengers worthy thumping bass — but what could it all mean?Here's the official synopsis: “Moore's Elisabeth Sparkle is a former A-lister past her prime who is suddenly fired from her fitness TV show by repellent studio head Harvey (Dennis Quaid). She is then drawn to the opportunity presented by a mysterious new drug, The Substance. All it takes is one injection and she is reborn - temporarily - as the gorgeous, twentysomething Sue (Qualley). The only rule? Time needs to be split: exactly one week in one body, then one week in the other. No exceptions. A perfect balance. What could go wrong?”What could go wrong indeed. We'll find out for ourselves when writer-director Fargeat's latest provocation, The Substance, hits cinemas on 20 September",
    "image":"https://images.bauerhosting.com/empire/2024/07/Demi-Moore-The-Substance.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}