{
    "id":"nd023",
    "title": "Shelley Duvall Dies, Aged 75",
    "full_article":"Shelley Duvall, known for her performance opposite Jack Nicholson in The Shining, has passed away at the age of 75, it has been confirmed. Though she didn't appear in many projects over the past couple of decades, she starred in a range of classic movies across the 1970s and 80s.The actor died in her sleep of complications from diabetes, at her home in Texas. Duvall's partner Dan Gilroy confirmed the news to The Hollywood Reporter, sharing the following statement: “My dear, sweet, wonderful life partner and friend left us. Too much suffering lately, now she's free. Fly away, beautiful Shelley.”Born on 7 July 1949 in Fort Worth, Texas, Shelley Duvall didn't initially pursue an acting career in her youth, instead focusing on science, studying nutrition and diet therapy at South Texas Junior College. It was only after being discovered by members of director Robert Altman's team whilst they were shooting comedy movie Brewster McCloud that she was convinced to do a screen test, and then made her on-screen debut in the film.Altman became somewhat of a mentor to Duvall, with them going on to work together on a total of six more films: McCabe & Mrs. Miller; Thieves Like Us; Nashville; Buffalo Bill And The Indians, Or Sitting Bull's History Lesson; 3 Women (for which she won the Best Actress Award at Cannes Film Festival, for her performance as health spa worker Millie Lamoureaux); and as comic-strip character Olive Oil in the live-action adaptation of Popeye.Elsewhere, she was on scene-stealing form as a Rolling Stone journalist in Annie Hall in 1997, popped up in Time Bandits in 1981, and, perhaps most famously, played Wendy Torrance in Stanley Kubrick's chilling Stephen King adaptation The Shining. Despite infamously facing a tough time whilst shooting the film, her wide-eyed turn as Nicholson's Jack Torrance's terrified wife is endlessly empathetic and memorable, her face as Jack attacks her with an axe creating one of the most iconic shots in horror movie history.Duvall's distinctive physicality and magnetic vulnerability made her one of the most compelling character actors of her time, with Altman once saying that she “was able to swing all sides of the pendulum: charming, silly, sophisticated, pathetic, even beautiful.” Despite ill health and other factors meaning she was off Hollywood's radar for years, Duvall's legacy as one of cinema's most singular screen presences will live on.",
    "image":"https://images.bauerhosting.com/empire/2024/07/the-shining-1.png?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}