{
    "id":"nd024",
    "title": "Empire VIP Event: Coraline Screening, Q&amp;A And LAIKA Exhibit Preview",
    "full_article":"Since 2009, LAIKA have established themselves as one of the world's foremost game-changers in stop-motion animation. On the afternoon of Saturday 10 August, Empire VIP members will be able to join us for a very special 15th anniversary family screening of the classic Coraline in newly remastered 3D, followed by a Q&A with director Henry Selick and star Teri Hatcher.Not only that but you will also get a sneak preview of a new exhibition, LAIKA Frame X Frame. Co-presented by the BFI, this is a totally immersive experience that celebrates the craft and nuance in the studio's physical puppets, sets and props, as well as exhibits that transport you into Coraline's Other Garden. It will be a magical afternoon, so don't delay. A world of wonder awaits.This event is exclusively for Empire VIPs. VIP Members are eligible for all events, however live events will have limited capacity and tickets will be allocated on a first come, first served basis.Not a member of the club, but want an invite? If you're entirely new to subscribing to Empire in any way, click the button below to sign up to become an Empire VIP by midnight on Friday 19 July, and be in with a chance of coming along. If you're an existing mag subscriber, or digital member, click here to login and upgrade to the VIP membership.Empire's VIP Club package, as well as access to exclusive events like these, includes a subscription to the print and digital editions of the mag, the Empire Spoiler Special podcast, a 12-month Picturehouse or My Cineworld Plus membership, plus more perks and bonus content. Please note, our VIP Club is currently open to UK residents only.Already an Empire VIP? Great! Mark your calendars for Saturday 10 August, and keep an eye out on Wednesday 24 July at 7pm for the official invite to make its way into your inboxes, where you can secure your tickets.FAQs:How do the tickets work?You will receive your ticket via email. This is what you'll need to present for scanning upon entrance into the screening, and also to be checked to gain entry into the exhibit.What's the location of the event?The exact venue of the screening will be confirmed on your tickets, but we can share that it is a central London location.What's the itinerary for the event?The Coraline screening will start at 12pm, and the Q&A will follow, with that finishing around 2:15pm. There will be two blocks of time for VIPs to visit the exhibit, 10am-12pm and around 2pm-4pm. We will confirm details about how to book your exhibit slot closer to the event.Can I bring children?Absolutely! This is a family event, and we encourage bringing the whole gang along. As such, we are allowing VIPs to bring up to three guests with them, rather than the usual maximum of one. Please note that Coraline is rated PG for Parental Guidance.Can I ask for autographs?No, there will be no opportunity to meet talent and request autographs during this event, and we ask that attendees please respect this.Disabled access,If you have any access requirements, please email empirevip@bauermedia.co.uk and we will liaise with the venue regarding these for you.Is there a dress code?No specific dress code! Just whatever you feel comfortable in - whatever you'd usually wear for a cinema trip!Photography,please note that photographs and footage will be taken throughout the event. These will be used by the event organisers for marketing and publicity in our publications, on our website and in social media or in any third party publication. If you don't consent to being in photographs, please do not attend.Are seats allocated?No, there is no seat allocation - the event will be general admission, filling up on a first come, first served basis.Please note that if you are late to arrive at the screening, we cannot guarantee your seat, even if you are a ticket-holder.",
    "image":"https://images.bauerhosting.com/empire/2024/07/LAIKA-VIP-HORIZONTAL-NEW.png?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}