{
    "id":"nd025",
    "title": "Kevin Costner's Horizon: An American Saga - Chapter 2 Pulled From August Cinema Release",
    "full_article":"After giddying up to bring Horizon: An American Saga — Chapter 1 to cinemas just last month, director-star Kevin Costner is going to have to hold his horses before delivering the second instalment in his four-part Western epic. Per THR's reporting, Horizon: An American Saga — Chapter 2 has been dropped from its originally planned 16 August theatrical release date, and will instead hit cinemas at an as-yet-unconfirmed later point in time.The official reason cited for Costner's Territory Pictures and New Line Cinema temporarily pulling the pin on the sequel's release is that they want to give the first film a chance to grow its audience. Having to date made $25 million on a $100 million budget ($58 million of which came from Costner's own coffers), it's seems that the filmmaker's wildly ambitious, passion-fuelled big genre swing has yet to really connect with cinemagoers. However, with the film set to hit PVOD platforms on 16 July, Costner and co will be hoping to lasso the streaming crowd and corral them back to the multiplex when Horizon's sequel does release.In a public statement, Territory Pictures put a positive spin on the otherwise disheartening news: “The audience response to Horizon, and enthusiasm for seeing our story continue in Horizon 2, has been incredibly gratifying. Kevin made this film for people who love movies and who wanted to go on a journey. The support that we have received from film fans, and the theater owners, as they experience the first chapter of this saga only serves to reinforce our belief in them and the films that we have made, and we thank them for coming on board for the ride. We welcome the opportunity for that window to be expanded as we know it will only serve to enhance the experience of seeing Horizon 2.”After a rocky start to summer blockbuster season with the underwhelming box office performances of Furiosa: A Mad Max Saga and The Fall Guy, things have been looking up of late. Inside Out 2 has crossed the hallowed $1 billion mark in recent weeks, A Quiet Place: Day One has enjoyed the franchise's biggest opening to date, and with Despicable Me 4 raking in the big bucks and Deadpool & Wolverine just around the corner, cinema foyers have started filling up once more. And so, hopefully brighter times await on Horizon's, well, horizon.",
    "image":"https://images.bauerhosting.com/empire/2024/07/Horizon-Chapter-1.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}