{
    "id":"nd027",
    "title": "Watchmen Chapter 1 Trailer: Titus Welliver Is Out To Catch A Killer In New DC Animated Movie",
    "full_article":"We all know the immortal question: 'Who watches the Watchmen?' And twice over now, the answer has been, well, us. First with Zack Snyder's epic three-hour adaptation of Alan Moore and Dave Gibbons' seminal superhero satirising comic book run back in 2009, and again with Damon Lindelof's stunning 2019 sequelisation of the source material. Now, as Warner Bros. Animation prepares its to release two-part feature-length take on DC's alt-history classic — vaunted as the first truly faithful screen adaptation of the story — we're in the tank for a third watch of the Watchmen. Oh yeah, we're thinking Watchmen's back! From Titus Welliver's glass-garglingly gruff Rorschach narration, to the provocative 2D-3D hybridised recreation of Gibbons' iconic comic panels and colourist John Higgins' punchy palette, to the flashes of ultra-violent head-popping and our first proper look at/listen to Michael Cerveris' Dr. Manhattan, it looks like director Brandon Vietti and writer J. Michael Straczynski (yes, the comic book legend) have nailed this one. And whilst most if not all of the people interested in this adaptation will already know the plot here, WB's succinct official synopsis has you covered just in case: 'In an alternate world, the murder of a government-sponsored superhero draws his outlawed colleagues out of retirement, into a mystery that threatens their lives and the world itself.' Do you hear that? It's the sound of The Comedian crashing through a glass window, the Doomsday Clock ticking down to apocalypse, and all Hell breaking loose friends.Matthew Rhys, Katee Sackhoff, and Troy Baker join Welliver and Cerveris in leading the stacked voice cast for this one, playing Nite Owl, Silk Spectre, and Ozymandias respectively. Elsewhere, Rick D. Wasserman's The Comedian, Adrienne Barbeau's Sally Jupiter, Jeffrey Combs' Moloch, and Geoff Pierson's Hollis Mason round out the principal cast. Corey Burton, John Marshall Jones, Yuri Lowenthal, and Kari Wahlgren are also lending their voices to the film too.Set to hit digital platforms on 13 August, we don't have long to wait until we can watch the Watchmen again. In the meantime, we continue to live in hope that 'faithful adaptation' means we'll get to see the OG comics' giant fake mutant squid descend upon New York. Wouldn't that just be *ahem* ink-credible?",
    "image":"https://images.bauerhosting.com/empire/2024/07/Watchmen.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}