{
    "id":"nd019",
    "title": "Shawn Levy Star Wars Movie Hires The Adam Project Writer Jonathan Tropper",
    "full_article":"With his hotly anticipated MCU joint Deadpool & Wolverine barely a *snikt* away from hitting cinemas, director Shawn Levy could be forgiven for taking some time out to bask in his summer blockbuster's imminent box office glow. Instead, the filmmaker's focus is already turning towards the other big franchise film on his horizon, the as-yet-untiled Star Wars movie announced back in 2022. As reported by THR, Levy is getting set to reteam with The Adam Project scribe and frequent collaborator Jonathan Tropper to take viewers to that galaxy far, far away.Per THR's reporting, Lucasfilm has hired Tropper to pen Levy's feature, which currently has no release date or shooting schedule. As well as promoting Deadpool & Wolverine, Levy's hands are already pretty full producing and directing episodes of Stranger Things S5, not to mention potentially prepping to helm the next Avengers movie. All of which is to say that we probably shouldn't expect to see this one hitting our screens any time soon; Jon Favreau's The Mandalorian & Grogu — slated for a 22 May, 2026 release — is still primed to be the first big-screen star war since The Rise Of Skywalker.Nevertheless, even with no release window, plot details, or casting news forthcoming just yet, Tropper's hiring is a promising sign that we will see Levy's take on the world George Lucas created eventually. And, having served as showrunner on See and created the likes of Banshee and Warrior — not to mention bringing more than a flavour of lightsaber-like spectacle to his Adam Project script — Tropper certainly has the genre nous to back up Levy's blockbuster acumen. It's still early days yet, but the Force is getting stronger with this one. And, in the meantime, The Acolyte series finale is just a week away — holy High Republic!",
    "image":"https://images.bauerhosting.com/empire/2024/07/Shawn-Levy-Jonathan-Tropper.jpg?ar=16%3A9&amp;fit=crop&amp;crop=top&amp;auto=format&amp;w=256&amp;q=80"
}